<?php
/**
 * 业务码、业务信息类
 */
namespace app\common;

class Message{
    /**
     * 信息内容map
     * @remark [code=>msg]
     * @return array
     */
    private function map(){
        return [
            200 => '操作成功',
            201 => '无任何数据更新',
            202 => '上传成功',
            400 => '请求错误',
            401 => '登录态消失，请重新登录',
            604 => '当前用户不存在',
            605 => '当前账号已被锁定',
            614 => '当前用户组不存在',
            615 => '当前用户组被锁定',
            621 => '上传失败',
            701 => '用户名格式错误',
            702 => '密码格式错误',
            703 => '登录密码错误',
            704 => '登录失败，请刷新页面重试',
            705 => '登录更新失败，请刷新页面重试',
            706 => '登录态更新失败，请刷新页面重试',
            707 => '您没有当前操作权限',
            710 => '查看的数据不存在',
            711 => '操作的数据不存在',
            712 => '数据格式错误',
            713 => '数据操作失败',
            714 => '店铺有进行中的活动或者开始时间小于今天',
            715 => '店铺已存在,不能重复添加',
            716 => '商家不存在或商家未绑定坐标信息',
            717 => '同步提审活动失败',
            718 => '当前活动不为提审状态',
            719 => '当前活动已结束',
            720 => '当前活动未上架',
            721 => '开奖时间已过，活动不能上架',
            722 => '奖品数量不足',
            723 => '口令抽奖必须输入参与口令',
            921 => '状态相同，不需要编辑',
            922 => '已审核不能再次改变状态',
            810 => '退款参数有误',
            811 => '没有根据订单号找到退款信息',
            888 => '填写完整的会员信息',
            900 => 'serial_number长度小于28位',
            901 => '退款信息不存在',
            902 => '请求错误money只能在 1 - 100000000 之间'
        ];
    }
    /**
     * 获取某个code的返回值
     * @param int $code 状态码
     * @return string
     */
    public function get($code=200){
        $msg = $this->map();
        if(!empty($msg[$code])){
            return $msg[$code];
        }else{
            return '';
        }
    }
}